dependencies/OpenFOAM/tutorials/multiphase/overInterDyMFoam/rigidBodyHull/background/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    "(atmosphere|inlet)"
    {
        type            calculated;
        value           $internalField;
    }

    "(BLADES|HUB_DISK|HUB|HUB_COVER|HULL*.*)"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    "(overset-1|oversetPatch)"
    {
        type           overset;
    }
}


// ************************************************************************* //
